In [1]:
import pandas as pd
import numpy as np

import pymysql #to get data from a sql database
from sqlalchemy import create_engine #to establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

# Create a Python connection with SQL database

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila' #this holds all the info (the user, the db location etc) that later pymysql will use to access sql
engine = create_engine(connection_string) #the engine is the aceess point to the db. the created engine keeps the db connection open

# Retrieve the results of the following queries as dataframes

In [4]:
# How many distinct (different) actors' last names are there?

query_1= "SELECT COUNT(DISTINCT last_name) FROM sakila.actor;"
print(query_1)

SELECT COUNT(DISTINCT last_name) FROM sakila.actor;

In [5]:
data_1 = pd.read_sql_query(query_1, engine)
data_1.head()

   COUNT(DISTINCT last_name)
0                        121

In [6]:
# Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

query_2="SELECT *, CASE WHEN weekday(rental_date) = 5 OR weekday(rental_date) = 6 then 'weekend' ELSE 'workday' END AS 'day_type' FROM sakila.rental;"
print(query_2)

SELECT *, CASE WHEN weekday(rental_date) = 5 OR weekday(rental_date) = 6 then 'weekend' ELSE 'workday' END AS 'day_type' FROM sakila.rental;

In [7]:
data_2 = pd.read_sql_query(query_2, engine)
data_2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday

In [8]:
data_2.shape

(16045, 8)

In [9]:
# Get all films with ARMAGEDDON in the title.

query_3 = "SELECT * FROM sakila.film WHERE title LIKE ('%%ARMAGEDDON%%');"
print(query_3)

SELECT * FROM sakila.film WHERE title LIKE ('%%ARMAGEDDON%%');

In [10]:
data_3 = pd.read_sql_query(query_3, engine)
data_3.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [11]:
data_3.shape

(6, 13)

In [12]:
# Get 10 the longest films.

query_4="SELECT * FROM film ORDER BY length DESC LIMIT 10;"
print(query_4)

SELECT * FROM film ORDER BY length DESC LIMIT 10;

In [13]:
data_4 = pd.read_sql_query(query_4, engine)
data_4.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,349,GANGS PRIDE,A Taut Character Study of a Woman And a A Shar...,2006,1,None,4,2.99,185,27.99,PG-13,Behind the Scenes,2006-02-15 05:03:42
1,872,SWEET BROTHERHOOD,A Unbelieveable Epistle of a Sumo Wrestler And...,2006,1,None,3,2.99,185,27.99,R,Deleted Scenes,2006-02-15 05:03:42
2,609,MUSCLE BRIGHT,A Stunning Panorama of a Sumo Wrestler And a H...,2006,1,None,7,2.99,185,23.99,G,Deleted Scenes,2006-02-15 05:03:42
3,817,SOLDIERS EVOLUTION,A Lacklusture Panorama of a A Shark And a Pion...,2006,1,None,7,4.99,185,27.99,R,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42
4,690,POND SEATTLE,A Stunning Drama of a Teacher And a Boat who m...,2006,1,None,7,2.99,185,25.99,PG-13,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [14]:
# How many films include Behind the Scenes content?

query_5="SELECT COUNT(*) FROM film WHERE special_features LIKE '%%BEHIND THE SCENES%%';"
print(query_5)

SELECT COUNT(*) FROM film WHERE special_features LIKE '%%BEHIND THE SCENES%%';

In [15]:
data_5 = pd.read_sql_query(query_5, engine)
data_5.head()

   COUNT(*)
0       538

In [16]:
# Which kind of movies (rating) have a mean duration of more than two hours?

query_6= "SELECT rating, ROUND(AVG(length),2) AS 'the mean duration of the film' FROM sakila.film GROUP BY rating HAVING (ROUND(AVG(length),2)) >120;"
print(query_6)

SELECT rating, ROUND(AVG(length),2) AS 'the mean duration of the film' FROM sakila.film GROUP BY rating HAVING (ROUND(AVG(length),2)) >120;

In [17]:
data_6 = pd.read_sql_query(query_6, engine)
data_6.head()

  rating  the mean duration of the film
0  PG-13                         120.44

In [18]:
# Rank films by length (filter out the rows that have nulls or 0s in length column).
# In your output, only select the columns title, length, and the rank.

query_7= "SELECT title, length, RANK () OVER (ORDER BY length) AS 'rank' FROM sakila.film WHERE length <> ' ' OR length!= NULL ORDER BY length DESC;"
print(query_7)

SELECT title, length, RANK () OVER (ORDER BY length) AS 'rank' FROM sakila.film WHERE length <> ' ' OR length!= NULL ORDER BY length DESC;

In [19]:
data_7 = pd.read_sql_query(query_7, engine)
data_7.head()

            title  length  rank
0   CHICAGO NORTH     185   991
1  CONTROL ANTHEM     185   991
2  DARN FORRESTER     185   991
3     GANGS PRIDE     185   991
4       HOME PITY     185   991

In [20]:
data_7.shape

(1000, 3)